# Brewfile - Declarative package management for macOS
# Generated by chezmoi from .chezmoidata/packages.toml
# DO NOT EDIT MANUALLY - Edit packages.toml instead
# Install with: brew bundle [--file=~/.config/Brewfile]

{{- $packages := .packages }}

# ============================================
# Homebrew Taps
# ============================================
{{- range $category, $items := $packages }}
{{- range $name, $pkg := $items }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "tap" }}
{{- $tapParts := splitList "/" $pkg.macos.tap }}
tap "{{ index $tapParts 0 }}/{{ index $tapParts 1 }}"
{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# Core System Tools
# ============================================
{{- range $name, $pkg := $packages.core }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# Shell & Terminal
# ============================================
{{- range $name, $pkg := $packages.shell }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "cask" }}
cask "{{ $pkg.macos.cask }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# Fonts
# ============================================
{{- range $name, $pkg := $packages.fonts }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "cask" }}
cask "{{ $pkg.macos.cask }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# Editor & Development
# ============================================
{{- range $name, $pkg := $packages.editor }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "cask" }}
cask "{{ $pkg.macos.cask }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# Development Tools
# ============================================
{{- range $name, $pkg := $packages.dev }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "cask" }}
cask "{{ $pkg.macos.cask }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# Languages & Version Managers
# ============================================
{{- range $name, $pkg := $packages.languages }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "cask" }}
cask "{{ $pkg.macos.cask }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# System Utilities
# ============================================
{{- range $name, $pkg := $packages.utilities }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "cask" }}
cask "{{ $pkg.macos.cask }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}

# ============================================
# macOS-Only Packages
# ============================================
{{- range $name, $pkg := $packages.macos_only }}
{{- if hasKey $pkg "macos" }}
{{- if hasKey $pkg.macos "brew" }}
brew "{{ $pkg.macos.brew }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "cask" }}
cask "{{ $pkg.macos.cask }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- else if hasKey $pkg.macos "tap" }}
cask "{{ $pkg.macos.tap }}"{{- if hasKey $pkg.macos "args" }}, args: {{ $pkg.macos.args | toJson }}{{- end }}
{{- end }}
{{- end }}
{{- end }}
